```data.archive_file.libs_zip: Reading...
data.archive_file.app_zip: Reading...
data.archive_file.app_zip: Read complete after 0s [id=b4f1ff1a8dece0ed59221194a68b3b06d8e77933]
data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
aws_iam_role.LambdaExecRole: Refreshing state... [id=throwtrash-lambda-role-ap-northeast-1]
aws_s3_bucket.PreferenceBucket: Refreshing state... [id=throwtrash-skill-preference-ap-northeast-1]
aws_s3_bucket.RequestLogBucket: Refreshing state... [id=throwtrash-skill-request-logs-ap-northeast-1]
data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
data.archive_file.libs_zip: Read complete after 2s [id=fe7bba6b46f84bfbcc6469557bd6550a24bb6412]
aws_lambda_layer_version.Layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-skill-libs:17]
aws_lambda_function.ThrowTrashSkill: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:ThrowTrashSkill]
aws_s3_bucket_acl.RequestLogBucketAcl: Refreshing state... [id=throwtrash-skill-request-logs-ap-northeast-1,private]
aws_s3_bucket_acl.PreferenceBucketAcl: Refreshing state... [id=throwtrash-skill-preference-ap-northeast-1,private]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.LambdaExecPolicy will be created
  + resource "aws_iam_policy" "LambdaExecPolicy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "throwtrash-lambda-policy-ap-northeast-1"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "dynamodb:*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:ap-northeast-1:188970983837:table/throwtrash-db-schedule",
                          + "arn:aws:dynamodb:ap-northeast-1:188970983837:table/throwtrash-db-accesstoken",
                        ]
                    },
                  + {
                      + Action   = "lambda:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:lambda:ap-northeast-1:188970983837:function:ThrowTrashSkill"
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::throwtrash-skill-preference-ap-northeast-1",
                          + "arn:aws:s3:::throwtrash-skill-preference-ap-northeast-1/*",
                          + "arn:aws:s3:::throwtrash-skill-request-logs-ap-northeast-1",
                          + "arn:aws:s3:::throwtrash-skill-request-logs-ap-northeast-1/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags      = {
          + "app"   = "throwtrash"
          + "group" = "skill"
        }
      + tags_all  = {
          + "app"   = "throwtrash"
          + "group" = "skill"
        }
    }

  # aws_iam_role.LambdaExecRole will be updated in-place
  ~ resource "aws_iam_role" "LambdaExecRole" {
        id                    = "throwtrash-lambda-role-ap-northeast-1"
        name                  = "throwtrash-lambda-role-ap-northeast-1"
      ~ tags                  = {
          + "app"   = "throwtrash"
          + "group" = "skill"
        }
      ~ tags_all              = {
          + "app"   = "throwtrash"
          + "group" = "skill"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role_policy_attachment.LambdaRolePolicyAttachment will be created
  + resource "aws_iam_role_policy_attachment" "LambdaRolePolicyAttachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "throwtrash-lambda-role-ap-northeast-1"
    }

  # aws_lambda_function.ThrowTrashSkill will be updated in-place
  ~ resource "aws_lambda_function" "ThrowTrashSkill" {
      + filename                       = "./app/app.zip"
        id                             = "arn:aws:lambda:ap-northeast-1:188970983837:function:ThrowTrashSkill"
      ~ last_modified                  = "2024-01-08T12:50:29.533+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-skill-libs:16",
          + "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-skill-libs:17",
        ]
      + publish                        = false
      ~ runtime                        = "nodejs16.x" -> "nodejs18.x"
      ~ source_code_hash               = "+JO5KaUk9TmewJRaJX4em3+m7zjOD4i2QtebSI07ZpM=" -> "xuMdHOGusioVs0uXeTbwBkWRif4RmOiuzX6on1ahepM="
      ~ tags                           = {
          - "Group"            = "throwtrash" -> null
          - "Purpose"          = "Skill" -> null
          + "app"              = "throwtrash"
          + "group"            = "skill"
          - "lambda:createdBy" = "SAM" -> null
        }
      ~ tags_all                       = {
          - "Group"            = "throwtrash" -> null
          - "Purpose"          = "Skill" -> null
          + "app"              = "throwtrash"
          + "group"            = "skill"
          - "lambda:createdBy" = "SAM" -> null
        }
        # (13 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "MECAB_API_KEY"       = "KZ0i4QQOku7RCYMHDx1m54Jf4eXpCjy16f83AtXx"
              + "MECAB_API_URL"       = "https://d698010tff.execute-api.ap-northeast-1.amazonaws.com/prod"
              - "MecabAPI_URL"        = "http://140.238.205.11" -> null
              ~ "RUNLEVEL"            = "INFO" -> "DEBUG"
                # (3 unchanged elements hidden)
            }
        }

      - timeouts {}

        # (1 unchanged block hidden)
    }

  # aws_lambda_permission.LambdaEvent will be created
  + resource "aws_lambda_permission" "LambdaEvent" {
      + action             = "lambda:InvokeFunction"
      + event_source_token = "amzn1.ask.skill.2ef932ba-f1a7-4638-ba85-90ad90a1f0c0"
      + function_name      = "arn:aws:lambda:ap-northeast-1:188970983837:function:ThrowTrashSkill"
      + id                 = (known after apply)
      + principal          = "alexa-appkit.amazon.com"
      + statement_id       = "AllowExecutionFromAlexa"
    }

Plan: 3 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now. ```